[tasks]
cvr
prv
bmcc

[options]
cvr: mode cover
prv: mode prove
bmcc: mode bmc

[engines]
cvr: smtbmc z3
prv: smtbmc z3
bmcc: btor btormc

[script]
design -reset
read -formal bit8_adder.sv
hierarchy -check -top bit8_adder
prep -top bit8_adder

[files]
bit8_adder/bit8_adder.sv
