[options]
mode bmc

[engines]
btor btormc

[script]
design -reset
read -formal alu.sv
hierarchy -check -top alu
prep -top alu

[files]
alu/alu.sv
