[tasks]
cvr
prv
bmcc

[options]
cvr: mode cover
prv: mode prove
bmcc: mode bmc

[engines]
cvr: smtbmc z3
prv: smtbmc z3
bmcc: btor btormc

[script]
design -reset
read -formal bit4_adder.sv
hierarchy -check -top bit4_adder
prep -top bit4_adder

[files]
bit4_adder/bit4_adder.sv
