[tasks]
cvr
prv
bmcc

[options]
cvr: mode cover
prv: mode prove
bmcc: mode bmc

[engines]
cvr: smtbmc z3
prv: smtbmc z3
bmcc: btor btormc

[script]
design -reset
read -formal full_adder.sv
hierarchy -check -top full_adder
prep -top full_adder

[files]
full_adder/full_adder.sv
