[tasks]
cvr
prv
bmcc

[options]
cvr: mode cover
prv: mode prove
bmcc: mode bmc

[engines]
cvr: smtbmc z3
prv: smtbmc z3
bmcc: btor btormc

[script]
design -reset
read -sv bit2_adder.sv
hierarchy -check -top bit2_adder
prep -top bit2_adder

[files]
bit2_adder/bit2_adder.sv
