# running in robot/FPV_bmcc/src/
sta
design -reset
read -formal robot_new.sv
hierarchy -check -top robot
prep -top robot

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
