[options]
mode cover

[engines]
smtbmc z3

[script]
design -reset
read -formal full_adder.sv
hierarchy -check -top full_adder
prep -top full_adder

[files]
full_adder/full_adder.sv
