[options]
mode prove

[engines]
smtbmc --progress z3

[script]
design -reset
plugin -i systemverilog
read -formal fifo.sv
hierarchy -check -top fifo
prep -top fifo

[files]
fifo_test/fifo.sv
