[options]
mode cover

[engines]
smtbmc z3

[script]
design -reset
read -formal half_adder.sv
hierarchy -check -top half_adder
prep -top half_adder

[files]
half_adder/half_adder.sv
