# running in alu/FPV_cvr/src/
design -reset
read -formal alu.sv
hierarchy -check -top alu
prep -top alu

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
