# running in fifo_test/FPV_cvr/src/
design -reset
plugin -i systemverilog
read -formal fifo.sv
hierarchy -check -top fifo
prep -top fifo

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
