[options]
mode bmc

[engines]
btor btormc

[script]
sta
design -reset
read -formal robot.sv
hierarchy -check -top robot
prep -top robot

[files]
robot/robot.sv
