# running in full_adder/FPV_prv/src/
design -reset
read -formal full_adder.sv
hierarchy -check -top full_adder
prep -top full_adder

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
