# running in robot/FPV_prv/src/
sta
design -reset
read -formal robot.sv
hierarchy -check -top robot
prep -top robot

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
